gitarmpit/libarmpit/lib/stm32f10x/lib/irq.h
#ifdef STM32F10X_XL
  IRQn_ADC1_2                 = 18,     /*!< ADC1 and ADC2 global Interrupt                       */
  IRQn_USB_HP_CAN1_TX         = 19,     /*!< USB Device High Priority or CAN1 TX Interrupts       */
  IRQn_USB_LP_CAN1_RX0        = 20,     /*!< USB Device Low Priority or CAN1 RX0 Interrupts       */
  IRQn_CAN1_RX1               = 21,     /*!< CAN1 RX1 Interrupt                                   */
  IRQn_CAN1_SCE               = 22,     /*!< CAN1 SCE Interrupt                                   */
  IRQn_EXTI9_5                = 23,     /*!< External Line[9:5] Interrupts                        */
  IRQn_TIM1_BRK_TIM9          = 24,     /*!< TIM1 Break Interrupt and TIM9 global Interrupt       */
  IRQn_TIM1_UP_TIM10          = 25,     /*!< TIM1 Update Interrupt and TIM10 global Interrupt     */
  IRQn_TIM1_TRG_COM_TIM11     = 26,     /*!< TIM1 Trigger and Commutation Interrupt and TIM11 global interrupt */
  IRQn_TIM1_CC                = 27,     /*!< TIM1 Capture Compare Interrupt                       */
  IRQn_TIM2                   = 28,     /*!< TIM2 global Interrupt                                */
  IRQn_TIM3                   = 29,     /*!< TIM3 global Interrupt                                */
  IRQn_TIM4                   = 30,     /*!< TIM4 global Interrupt                                */
  IRQn_I2C1_EV                = 31,     /*!< I2C1 Event Interrupt                                 */
  IRQn_I2C1_ER                = 32,     /*!< I2C1 Error Interrupt                                 */
  IRQn_I2C2_EV                = 33,     /*!< I2C2 Event Interrupt                                 */
  IRQn_I2C2_ER                = 34,     /*!< I2C2 Error Interrupt                                 */
  IRQn_SPI1                   = 35,     /*!< SPI1 global Interrupt                                */
  IRQn_SPI2                   = 36,     /*!< SPI2 global Interrupt                                */
  IRQn_USART1                 = 37,     /*!< USART1 global Interrupt                              */
  IRQn_USART2                 = 38,     /*!< USART2 global Interrupt                              */
  IRQn_USART3                 = 39,     /*!< USART3 global Interrupt                              */
  IRQn_EXTI15_10              = 40,     /*!< External Line[15:10] Interrupts                      */
  IRQn_RTCAlarm               = 41,     /*!< RTC Alarm through EXTI Line Interrupt                */
  IRQn_USBWakeUp              = 42,     /*!< USB Device WakeUp from suspend through EXTI Line Interrupt */
  IRQn_TIM8_BRK_TIM12         = 43,     /*!< TIM8 Break Interrupt and TIM12 global Interrupt      */
  IRQn_TIM8_UP_TIM13          = 44,     /*!< TIM8 Update Interrupt and TIM13 global Interrupt     */
  IRQn_TIM8_TRG_COM_TIM14     = 45,     /*!< TIM8 Trigger and Commutation Interrupt and TIM14 global interrupt */
  IRQn_TIM8_CC                = 46,     /*!< TIM8 Capture Compare Interrupt                       */
  IRQn_ADC3                   = 47,     /*!< ADC3 global Interrupt                                */
  IRQn_FSMC                   = 48,     /*!< FSMC global Interrupt                                */
  IRQn_SDIO                   = 49,     /*!< SDIO global Interrupt                                */
  IRQn_TIM5                   = 50,     /*!< TIM5 global Interrupt                                */
  IRQn_SPI3                   = 51,     /*!< SPI3 global Interrupt                                */
  IRQn_UART4                  = 52,     /*!< UART4 global Interrupt                               */
  IRQn_UART5                  = 53,     /*!< UART5 global Interrupt                               */
  IRQn_TIM6                   = 54,     /*!< TIM6 global Interrupt                                */
  IRQn_TIM7                   = 55,     /*!< TIM7 global Interrupt                                */
  IRQn_DMA2_Channel1          = 56,     /*!< DMA2 Channel 1 global Interrupt                      */
  IRQn_DMA2_Channel2          = 57,     /*!< DMA2 Channel 2 global Interrupt                      */
  IRQn_DMA2_Channel3          = 58,     /*!< DMA2 Channel 3 global Interrupt                      */
  IRQn_DMA2_Channel4_5        = 59      /*!< DMA2 Channel 4 and Channel 5 global Interrupt        */
#endif /* STM32F10X_XL */  

#ifdef STM32F10X_CL
  IRQn_ADC1_2                 = 18,     /*!< ADC1 and ADC2 global Interrupt                       */
  IRQn_CAN1_TX                = 19,     /*!< USB Device High Priority or CAN1 TX Interrupts       */
  IRQn_CAN1_RX0               = 20,     /*!< USB Device Low Priority or CAN1 RX0 Interrupts       */
  IRQn_CAN1_RX1               = 21,     /*!< CAN1 RX1 Interrupt                                   */
  IRQn_CAN1_SCE               = 22,     /*!< CAN1 SCE Interrupt                                   */
  IRQn_EXTI9_5                = 23,     /*!< External Line[9:5] Interrupts                        */
  IRQn_TIM1_BRK               = 24,     /*!< TIM1 Break Interrupt                                 */
  IRQn_TIM1_UP                = 25,     /*!< TIM1 Update Interrupt                                */
  IRQn_TIM1_TRG_COM           = 26,     /*!< TIM1 Trigger and Commutation Interrupt               */
  IRQn_TIM1_CC                = 27,     /*!< TIM1 Capture Compare Interrupt                       */
  IRQn_TIM2                   = 28,     /*!< TIM2 global Interrupt                                */
  IRQn_TIM3                   = 29,     /*!< TIM3 global Interrupt                                */
  IRQn_TIM4                   = 30,     /*!< TIM4 global Interrupt                                */
  IRQn_I2C1_EV                = 31,     /*!< I2C1 Event Interrupt                                 */
  IRQn_I2C1_ER                = 32,     /*!< I2C1 Error Interrupt                                 */
  IRQn_I2C2_EV                = 33,     /*!< I2C2 Event Interrupt                                 */
  IRQn_I2C2_ER                = 34,     /*!< I2C2 Error Interrupt                                 */
  IRQn_SPI1                   = 35,     /*!< SPI1 global Interrupt                                */
  IRQn_SPI2                   = 36,     /*!< SPI2 global Interrupt                                */
  IRQn_USART1                 = 37,     /*!< USART1 global Interrupt                              */
  IRQn_USART2                 = 38,     /*!< USART2 global Interrupt                              */
  IRQn_USART3                 = 39,     /*!< USART3 global Interrupt                              */
  IRQn_EXTI15_10              = 40,     /*!< External Line[15:10] Interrupts                      */
  IRQn_RTCAlarm               = 41,     /*!< RTC Alarm through EXTI Line Interrupt                */
  IRQn_OTG_FS_WKUP            = 42,     /*!< USB OTG FS WakeUp from suspend through EXTI Line Interrupt */
  IRQn_TIM5                   = 50,     /*!< TIM5 global Interrupt                                */
  IRQn_SPI3                   = 51,     /*!< SPI3 global Interrupt                                */
  IRQn_UART4                  = 52,     /*!< UART4 global Interrupt                               */
  IRQn_UART5                  = 53,     /*!< UART5 global Interrupt                               */
  IRQn_TIM6                   = 54,     /*!< TIM6 global Interrupt                                */
  IRQn_TIM7                   = 55,     /*!< TIM7 global Interrupt                                */
  IRQn_DMA2_Channel1          = 56,     /*!< DMA2 Channel 1 global Interrupt                      */
  IRQn_DMA2_Channel2          = 57,     /*!< DMA2 Channel 2 global Interrupt                      */
  IRQn_DMA2_Channel3          = 58,     /*!< DMA2 Channel 3 global Interrupt                      */
  IRQn_DMA2_Channel4          = 59,     /*!< DMA2 Channel 4 global Interrupt                      */
  IRQn_DMA2_Channel5          = 60,     /*!< DMA2 Channel 5 global Interrupt                      */
  IRQn_ETH                    = 61,     /*!< Ethernet global Interrupt                            */
  IRQn_ETH_WKUP               = 62,     /*!< Ethernet Wakeup through EXTI line Interrupt          */
  IRQn_CAN2_TX                = 63,     /*!< CAN2 TX Interrupt                                    */
  IRQn_CAN2_RX0               = 64,     /*!< CAN2 RX0 Interrupt                                   */
  IRQn_CAN2_RX1               = 65,     /*!< CAN2 RX1 Interrupt                                   */
  IRQn_CAN2_SCE               = 66,     /*!< CAN2 SCE Interrupt                                   */
  IRQn_OTG_FS                 = 67,      /*!< USB OTG FS global Interrupt                          */
#endif /* STM32F10X_CL */     
} IRQn_Type;



#endif
